namespace VRageMath
{
    using System;
    using System.Diagnostics;
    using System.Globalization;
    using System.Reflection;
    using System.Runtime.CompilerServices;
    using System.Runtime.InteropServices;
    using Unsharper;

    [Serializable, StructLayout(LayoutKind.Explicit)]
    public struct MatrixD : IEquatable<MatrixD>
    {
        public static MatrixD Identity;
        [FieldOffset(0)]
        public double M11;
        [FieldOffset(8)]
        public double M12;
        [FieldOffset(0x10)]
        public double M13;
        [FieldOffset(0x18)]
        public double M14;
        [FieldOffset(0x20)]
        public double M21;
        [FieldOffset(40)]
        public double M22;
        [FieldOffset(0x30)]
        public double M23;
        [FieldOffset(0x38)]
        public double M24;
        [FieldOffset(0x40)]
        public double M31;
        [FieldOffset(0x48)]
        public double M32;
        [FieldOffset(80)]
        public double M33;
        [FieldOffset(0x58)]
        public double M34;
        [FieldOffset(0x60)]
        public double M41;
        [FieldOffset(0x68)]
        public double M42;
        [FieldOffset(0x70)]
        public double M43;
        [FieldOffset(120)]
        public double M44;
        public static MatrixD Zero;

        static MatrixD()
        {
            Identity = new MatrixD(1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0);
            Zero = new MatrixD(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
        }

        public MatrixD(Matrix m)
        {
            this.M11 = m.M11;
            this.M12 = m.M12;
            this.M13 = m.M13;
            this.M14 = m.M14;
            this.M21 = m.M21;
            this.M22 = m.M22;
            this.M23 = m.M23;
            this.M24 = m.M24;
            this.M31 = m.M31;
            this.M32 = m.M32;
            this.M33 = m.M33;
            this.M34 = m.M34;
            this.M41 = m.M41;
            this.M42 = m.M42;
            this.M43 = m.M43;
            this.M44 = m.M44;
        }

